reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "AppACADEMY"], ["description", "Questions"], ["created_at", "2021-02-15 22:16:49.396734"], ["updated_at", "2021-02-15 22:16:49.396734"]]